[
    {
        "name": "Erik Brynjolfsson",
        "title": "Director, The MIT Initiative on the Digital Economy",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009QyLF&d=%2Fa%2F6g000000gLdj%2F6NNZYrgL4HOcjnvx9llMGVsrI896tUfmpfHJBYPxz2o&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Erik Brynjolfsson is Director of MIT’s Initiative on the Digital Economy, Schussel Family Professor of Management Science at the MIT Sloan School, and research associate at the National Bureau of Economic Research. His research examines the effects of information technologies on business strategy, productivity and performance, digital commerce, and intangible assets.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Andrew Paul McAfee",
        "title": "Principal Research ScientistThe MIT Center for Digital Business",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW7I&d=%2Fa%2F6g000000gLdz%2FA6twgIpHKG55TcCHuWEgLfD989pad_607cBF22uazIA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "His research investigates how information technology changes the way companies perform, organize themselves, and compete. At a higher level, his work also focuses on how computerization affects competition, society, the economy, and the workforce. In addition to having numerous papers published, Professor McAfee also writes a widely read blog, which is at times one of the 10,000 most popular in the world. He is the author or co-author of more than 100 articles, case studies and other materials for students and teachers of technology. Prior to joining MIT Sloan, McAfee was a professor at Harvard Business School. He has also served as a fellow at the Berkman Center for Internet and Society at Harvard Law School. McAfee received his doctorate from Harvard Business School, and completed two Master of Science and two Bachelor of Science degrees at MIT. He speaks frequently to both academic and industry audiences, and has taught in executive education programs around the world.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Roberto Fernandez",
        "title": "William F. Pounds Professor in ManagementProfessor, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1s2&d=%2Fa%2F6g000000gKzs%2FntV4R8_mbBKiuRcdx2ZPfSc08u5M_kTE3jv5xwaw5do&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Roberto M. Fernandez is the William F. Pounds Professor in Management and a Professor of Organization Studies at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Cassandra Frangos",
        "title": "Executive Development & C-Suite Succession Advisor",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWAV&d=%2Fa%2F6g000000gLdu%2Fg3tANZRI57ZBLWZjYUxmfNAjlJo56qbsYhCQLcorgrI&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Cassandra Frangos, Ed.D., joins the MIT Sloan Executive Education team as an expert adviser and coach on leadership and organizational transformation. She is a consultant on Spencer Stuart’s Leadership Advisory Services team and also a coach in Harvard Executive Education Programs. She collaborates with Fortune 500 leadership teams on executive assessments, succession planning, leadership development, and top team effectiveness.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "John Carrier",
        "title": "Senior Lecturer, System Dynamics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73Jl&d=%2Fa%2F6g000000gvTp%2FnjAO1XNbwHPTYf7Hx2nxTt4KMsk..MZxtzXAIvZ72v4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "John Carrier is a Senior Lecturer of System Dynamics at the MIT Sloan School of Management. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Retsef Levi",
        "title": "J. Spencer Standish (1945) Professor of ManagementProfessor, Operations ManagementCo-Director of Leaders for Global Operations Program",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1uN&d=%2Fa%2F6g000000gL1t%2F5b3waIr_9BVWhB4kfWHtrdPmFgnY45XKyB_mOiuPgR4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Retsef Levi is the J. Spencer Standish (1945) Professor of Operations Management at the MIT Sloan School of Management. He is a member of the Operations Management Group at MIT Sloan and affiliated with the MIT Operations Research Center. Levi also serves as the Faculty Co-Director of the MIT Leaders for Global Operations (LGO).",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Miho Mahzereeuw",
        "title": "Associate Professor of Architecture and Urbanism",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6tVf&d=%2Fa%2F6g000000gv4K%2FdahUKZu.D231GRAiuwhOgRryrGXIxfXwuGwIwBPglPo&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Miho Mazereeuw is an assistant professor of architecture and urbanism at MIT and is the founder of the Urban Risk Lab [UrbanRiskLab.org]. Working on a large, territorial scale with an interest in public spaces and the urban experience, Mazereeuw is known for her work in disaster resilience.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Catherine Tucker",
        "title": "Sloan Distinguished Professor of ManagementProfessor, MarketingChair MIT Sloan PhD Program",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1m5&d=%2Fa%2F6g000000gKuj%2Foq7eZCeSfoCOKRSa21pwNlCPBzT7pyVZGcIpVkB.GEw&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Catherine Tucker is the Sloan Distinguished Professor of Management and a Professor of Marketing at MIT Sloan. She is also Chair of the MIT Sloan PhD Program.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Renee Richardson Gosline",
        "title": "Senior Lecturer and Research Scientist, Marketing",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWIL&d=%2Fa%2F6g000000gLer%2FgVXpELuMaJKmYuQTkrsu0ve_Hk5hMcaQ6qvvW0npv2o&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Sinan Kayhan Aral",
        "title": "David Austin Professor of ManagementProfessor, Information Technology and Marketing",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1ig&d=%2Fa%2F6g000000gKrU%2Ff81T0LlXH0Ya.VQiFnwwxttCyLVnnvWV83bwFNJmVj4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Sinan Aral a global authority on business analytics; award-winning researcher; entrepreneur, and venture capitalist. He is the David Austin Professor of Management, Marketing, IT and Data Science at MIT, Director of the MIT Initiative on the Digital Economy (IDE) and a Founding Partner at Manifest Capital.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Paul McDonagh-Smith",
        "title": "Senior Lecturer, IT and Executive Education",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009QpCq&d=%2Fa%2F6g000000gKeV%2FVYPJ5nqx8N_Cqz4jcfG9fY_OHTh84zLGM3IP1BHSqMo&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Barbara Wixom",
        "title": "Principal Research Scientist MIT Center for Information Systems Research (CISR)",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWEW&d=%2Fa%2F6g000000gLel%2F7XE_OR4SxMlvLeNByJi_eAvt2HZdMOTRY83zqttniIM&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Barbara’s academic research explores how organizations generate business value from data assets. She has deep expertise in data and analytics techniques and technologies, with particular interest in data and analytics strategy, capabilities, and success.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Phil Budden",
        "title": "Senior Lecturer, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1zc&d=%2Fa%2F6g000000gL73%2FMO3iS3gZpVxMYeIR73k9DVG_qPcABh9Nc6GeSjHCUAY&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Phil Budden is a Senior Lecturer at MIT's Management School, in Sloan's TIES (Technological Innovation, Entrepreneurship and Strategic-management) Group, where he focuses on 'innovation-driven entrepreneurship' (IDE) and innovation ecosystems.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Hal Gregersen",
        "title": "Senior Lecturer, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R219&d=%2Fa%2F6g000000gL8a%2FyIc7mIlGrz6eT08HAQLaOxcazxxuNt4RGp6VyRmoQYs&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Hal Gregersen is Executive Director of the MIT Leadership Center and a Senior Lecturer in Leadership and Innovation at the MIT Sloan School of Management where he pursues his vocation of executive teaching, coaching, and research by exploring how leaders in business, government, and society discover provocative new ideas, develop the human and organizational capacity to realize those ideas, and ultimately deliver positive, powerful results. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Thomas Roemer",
        "title": "Senior Lecturer, Operations Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1w9&d=%2Fa%2F6g000000gL3L%2Fa4MOIj2xMiGxQzpDxXuwqKvi4PyTekZkS_MNZuPZIjA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "David Simchi-Levi",
        "title": "Professor of Engineering Systems Massachusetts Institute of Technology",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWEU&d=%2Fa%2F6g000000gLeZ%2FEDz8BNYCCxbiKvYDG6blIbIRNqT3ZtDY10QQFAAOHjI&asPdf=false",
        "pdf_url": "",
        "intro_desc": "David Simchi-Levi is a Professor of Engineering Systems at Massachusetts Institute of Technology and the Co-Director of Leaders for Global Operations. His research currently focuses on developing and implementing robust and efficient techniques for logistics and manufacturing systems. He has published widely in professional journals on both practical and theoretical aspects of logistics and supply chain management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Steven Eppinger",
        "title": "General Motors Leaders for Global Operations Professor of ManagementProfessor of Management Science and Engineering SystemsCo-Director, System Design and Management Program",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1sl&d=%2Fa%2F6g000000gL0b%2F8WM8bxTF0ylInUtedLxz7OpXcRsH.TznfjBsqhJY5IE&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Steven D. Eppinger is the General Motors Leaders for Global Operations Professor, a Professor of Management Science and Engineering Systems, and the Co-Director of the System Design and Management Program at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Wanda Orlikowski",
        "title": "Alfred P. Sloan Professor of ManagementProfessor, Information Technologies and Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1rT&d=%2Fa%2F6g000000gKzJ%2FiR7NyjbIje2z4Dmu3xcrGv23oPBAhpRQ9RJmfC3E9xA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Wanda Orlikowski is the Alfred P. Sloan Professor of Management and a Professor of Information Technologies and Organization Studies at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Aithan Shapira",
        "title": "Lecturer, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R21T&d=%2Fa%2F6g000000gL8u%2F6DLwh6Sfs6z.lkvkK7uokOBuPeO06b8Lqp.LfGXzWLw&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Aithan Shapira (MFA PhD) is an internationally acclaimed artist and Lecturer at MIT Sloan.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Bruce Cameron",
        "title": "Director, System Architecture Lab Lecturer in Engineering Systems",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW7V&d=%2Fa%2F6g000000gLdZ%2F13E9EtzAWOL5WqjE3Ld8PF2L99eyBxwcpvoICb47vaM&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Bruce Cameron is a Lecturer in Engineering Systems at MIT and a consultant on platform strategies. His research interests include technology strategy, system architecture, and the management of product platforms. Previously, Dr. Cameron ran the MIT Commonality study, a 16-firm investigation of platforming returns, which concluded that firms face systemic downward pressure on commonality, partially resulting from challenges capturing the costs of variety. Dr. Cameron has supervised over 20 graduate students, and has directed research projects for BP, Sikorsky, Nokia, Caterpillar, NSTAR, AMGEN, Verizon, NASA, ESA, and Skoltech. Current research efforts include:",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Regina Barzilay",
        "title": "Delta Electronics Professor, EECS.Faculty Co-Lead, J-Clinic",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWBo&d=%2Fa%2F6g000000gLe3%2FoDdTznZtlvqPtC7u5hB1dxfR_A8zpS0u1aFv7X1TgLs&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Regina Barzilay is a Delta Electronics professor in the Department of Electrical Engineering and Computer Science and a member of the Computer Science and Artificial Intelligence Laboratory at the Massachusetts Institute of Technology. Her research interests are in natural language processing, applications of deep learning to chemistry and oncology. She is a recipient of various awards including the NSF Career Award, the MIT Technology Review TR-35 Award, Microsoft Faculty Fellowship and several Best Paper Awards at NAACL and ACL. In 2017, she received a MacArthur fellowship, an ACL fellowship and an AAAI fellowship. She received her Ph.D. in Computer Science from Columbia University, and spent a year as a postdoc at Cornell University.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Dimitris Bertsimas",
        "title": "Boeing Leaders for Global Operations Professor of ManagementAssociate Dean for Business Analytics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1p8&d=%2Fa%2F6g000000gKx8%2FVKxis7H0zSi.5Z9tsychEqKuHXSMweF3aGGgFt2x_iA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Dimitris Bertsimas is the Boeing Leaders for Global Operations Professor of Management, a Professor of Operations Research, and the Associate Dean for the Master of Business Analytics at MIT.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Tommi Jaakkola",
        "title": "Thomas Siebel Professor of Electrical Engineering and Computer Science and the Institute for Data, Systems, and Society",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73QI&d=%2Fa%2F6g000000gvUn%2FD_KXD_jbRvN4Xuyq0KHX27TH_40WB345Q2kmHEH9UoA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Tommi Jaakkola is the Thomas Siebel Professor of Electrical Engineering and Computer Science and the Institute",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Dina Katabi",
        "title": "Professor",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6z8M&d=%2Fa%2F6g000000gvWA%2FrZU9eCxLQ9FwZ2aPUl3Z7zio9s1oXnsPzAJku9Dnk1s&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Dina's research spans digital health, wireless sensors, mobile computing, machine learning and computer vision.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "David Sontag",
        "title": "Assistant Professor & Core Faculty",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6zDW&d=%2Fa%2F6g000000gvWU%2FQDW7hE8TaUjCcERZYt0ohZvsDOe3VgKVz_cwZpyk2V8&asPdf=false",
        "pdf_url": "",
        "intro_desc": "David Sontag joined the MIT faculty in 2017 as Hermann L. F. von Helmholtz Career Development Professor in the Institute for Medical Engineering and Science (IMES) and as Associate Professor in the Department of Electrical Engineering and Computer Science (EECS). He is also a principal investigator in the Computer Science and Artificial Intelligence Laboratory (CSAIL). Professor Sontag’s research interests are in machine learning and artificial intelligence. As part of IMES, he leads a research group that aims to transform healthcare through the use of machine learning.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Collin Stultz",
        "title": "Professor of Electrical Engineering and Computer Science, Institute for Medical Engineering and Science",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6zD2&d=%2Fa%2F6g000000gvWZ%2FFQkvZWg_S3VNcNLnYNu6D4EfHSmnJsD3hNDUSBaAaVQ&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Dr. Collin M. Stultz is a Professor of Electrical Engineering and Computer Science at the Massachusetts Institute of Technology (MIT), a faculty member in the Harvard-MIT Division of Health Sciences and Technology, a Professor in the Institute of Medical Engineering and Sciences at MIT, a member of the Research Laboratory of Electronics (RLE), and an associate member of the Computer Science and Artificial Intelligence Laboratory (CSAIL). He is also a practicing cardiologist at the Massachusetts General Hospital (MGH). ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Christian Catalini",
        "title": "Associate Professor, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R206&d=%2Fa%2F6g000000gL7X%2F66CM48F1LNhPJqtjqPKKEbiZ2TGrXJxnwv.urN.KNVY&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Christian Catalini is an Associate Professor of Technological Innovation, Entrepreneurship, and Strategic Management at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Simon Johnson",
        "title": "Ronald A. Kurtz (1954) Professor of EntrepreneurshipProfessor, Global Economics and Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1pX&d=%2Fa%2F6g000000gKxS%2F6tUIcViIyVLc3Em2tyGM3DLAB1.FL3ZeafrQKMFYRy4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "SIMON JOHNSON is the Ronald A. Kurtz (1954) Professor of Entrepreneurship at the MIT Sloan School of Management, where he is also head of the Global Economics and Management group. He co-founded and currently leads the popular Global Entrepreneurship Lab (GLAB) course – over the past 20 years. MBA students in GLAB have worked on more than 500 projects with start-up companies around the world.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Athanasios Orphanides",
        "title": "Professor of the Practice, Global Economics and Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1zI&d=%2Fa%2F6g000000gL6o%2FtCOIoHdR.4WW90644hNOWtHgMCrN1uF6oB0hsODd1jU&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Athanasios Orphanides is a Professor of the Practice of Global Economics and Management at the MIT Sloan School of Management. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Roberto Rigobon",
        "title": "Society of Sloan Fellows Professor of ManagementProfessor, Applied Economics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1ms&d=%2Fa%2F6g000000gKvb%2Fd9pR7mwMH9wh_Jco4fB566TcN7b33g4sBIrLx0vKXJg&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Roberto Rigobon is the Society of Sloan Fellows Professor of Management and a Professor of Applied Economics at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Deborah L. Ancona",
        "title": "Seley Distinguished Professor of ManagementProfessor, Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1vk&d=%2Fa%2F6g000000gL31%2F_8jpa1FruYj1g__ESWW.YT_ghyqFgG9yp4Grg9bLga0&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Deborah Ancona is the Seley Distinguished Professor of Management, a Professor of Organization Studies, and the Founder of the MIT Leadership Center at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Sandy Pentland",
        "title": "Toshiba Professor of Media Arts & ScienceProfessor, Information Technology",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73bt&d=%2Fa%2F6g000000gvV8%2F_77F4rowuBMWkaaZ9ynuul0xrZsSbhNpwcUkDl.mePA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Alex `Sandy’ Pentland directs MIT’s Human Dynamics Laboratory and the MIT Media Lab Entrepreneurship Program, co-leads the World Economic Forum Big Data and Personal Data initiatives, and is a founding member of the Advisory Boards for Nissan, Motorola Mobility, Telefonica, and a variety of start-up firms. He has previously helped create and direct MIT’s Media Laboratory, the Media Lab Asia laboratories at the Indian Institutes of Technology, and Strong Hospital’s Center for Future Health. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Emilio J. Castilla",
        "title": "NTU Professor of ManagementProfessor, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1kz&d=%2Fa%2F6g000000gKtY%2Fhf513ULR29xBNL5WDeoeSWJrFVe77MQ9wqYqHm71New&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Emilio J. Castilla is the NTU Professor of Management and a Professor of Work and Organization Studies at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "William Kenneth Aulet",
        "title": "Professor of the Practice, Technological Innovation, Entrepreneurship, and Strategic ManagementManaging Director, Martin Trust Center for MIT Entrepreneurship",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1Xn&d=%2Fa%2F6g000000gKq7%2FgJqS.ZeioViTq3tr_GbU4aWnrSoFQaouUQ64GYa2Xrc&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Bill Aulet is the Managing Director of the Martin Trust Center for MIT Entrepreneurship and Professor of the Practice at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Paul Cheek",
        "title": "Lecturer and Entrepreneur in Residence at the Martin Trust Center",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1hB&d=%2Fa%2F6g000000gKpa%2F3I4Je2BVp4pfKqcE11VQ9IaTCukR_cgXfHY.i.PCEvQ&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Paul Cheek is a serial tech entrepreneur, software engineer, an Entrepreneur in Residence at the Martin Trust Center for MIT Entrepreneurship, and a Lecturer at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Douglas Ready",
        "title": "Senior Lecturer, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1wJ&d=%2Fa%2F6g000000gL3f%2F8g0RFfpY4O4jbzT0bG4aK1_OFHrC8XVMhsbfOt8N.MY&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Jason Jay",
        "title": "Senior Lecturer, SustainabilityDirector, Sustainability Initiative at MIT Sloan",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1jU&d=%2Fa%2F6g000000gKs8%2Fp2bwuCtr9v2sqey64flkAk0WOPrpLuu1IJ8Hk5a8Nnc&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Jason Jay is a Senior Lecturer at the MIT Sloan School of Management and Director of the Sustainability Initiative at MIT Sloan.  ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "John D. Sterman",
        "title": "Jay W. Forrester Professor of ManagementProfessor, System Dynamics and Engineering SystemsDirector, MIT System Dynamics Group",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1hs&d=%2Fa%2F6g000000gKqb%2F53dRNAweV4_EiICmMrSg_SSHQCVfLti.IL1gialH8WM&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Geoffrey Parker",
        "title": "Director, Master of Engineering Management Program, Dartmouth CollegeProfessor of Engineering, Thayer School of Engineering, Dartmouth College",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW7J&d=%2Fa%2F6g000000gLeA%2FNbEfJoXyBVTFnu9oKDJpsU07edxP8QFjrzfu4TPbQso&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Geoffrey Parker is a Professor of Engineering and a Director in the Master of Engineering Management Program at Dartmouth's Thayer School of Engineering. He is also a Visiting Scholar and Research Fellow at MIT’s Initiative for the Digital Economy. He previously served as Director of the Tulane Energy Institute and on the General Electric (GE) Africa technical workforce advisory board.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Sanjay Sarma",
        "title": "Fred Fort Flowers (1941) and Daniel Fort Flowers (1941) Professor of Mechanical Engineering Vice President for Open Learning",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWBp&d=%2Fa%2F6g000000gLdv%2F2VaPQKgMxrMGMxQVblvXxjUjOau3rYROVu.DhpcL028&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Sanjay Sarma is the first Dean of Digital Learning at MIT. He co-founded the Auto-ID Center at MIT and developed many of the key technologies behind the EPC suite of RFID standards now used worldwide. He was also the the founder and CTO of OATSystems, which was acquired by Checkpoint Systems (NYSE: CKP) in 2008. He serves on the boards of GS1, EPCglobal, and several startup companies including Senaya and ESSESS. Dr. Sarma received his Bachelors from the Indian Institute of Technology, his Masters from Carnegie Mellon University, and his PhD from the University of California at Berkeley. Sarma also worked at Schlumberger Oilfield Services in Aberdeen, UK, and at the Lawrence Berkeley Laboratories in Berkeley, California. He has authored over 75 academic papers in computational geometry, sensing, RFID, automation, and CAD, and is the recipient of numerous awards for teaching and research including the MacVicar Fellowship, the Business Week eBiz Award, and Informationweek's Innovators and Influencers Award. He advises several national governments and global companies.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "George F Westerman",
        "title": "Principal Research Scientist",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1dr&d=%2Fa%2F6g000000gKxr%2FnOsfcBuT6fmT02_ns_lnQgT_4c0ZVLkZLeA_YXb_YQs&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Tara Swart",
        "title": "Senior Lecturer, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWQe&d=%2Fa%2F6g000000gLfK%2FJ9NZWJcx2aXc83XakxM.Yjf3ng8unsSmKdeR5sAqME8&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Tara Swart is a Senior Lecturer and Research Affiliate at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Vivek F. Farias",
        "title": "Patrick J. McGovern (1959) ProfessorProfessor",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1oZ&d=%2Fa%2F6g000000gKwj%2FRUHdgsgWP0u.G69zuMbfcaNi.3CEhlEl7J5sW_VHbGU&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Fiona E. Murray",
        "title": "William Porter Professor of EntrepreneurshipCo-Director, MIT Innovation InitiativeMember of the UK Prime Minister's Council for Science and Technology (CST)",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1l1&d=%2Fa%2F6g000000gKta%2FajXLdNuzd5GpHuTw7DRQQ6gPlP5NKbSCsf575ITuVz4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Fiona Murray is the Associate Dean for Innovation and Inclusion at the MIT Sloan School of Management, the William Porter (1967) Professor of Entrepreneurship, and an associate of the National Bureau of Economic Research. She is also the co-director of MIT’s Innovation Initiative.  ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Stuart E. Madnick",
        "title": "John Norris Maguire (1960) Professor of Information Technology, EmeritusProfessor, Information Technology and Engineering SystemsCo-Director, PROFIT Program",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1hx&d=%2Fa%2F6g000000gKqg%2FuWexlUP_eJT9droR.V8Dv1ARrw5PGARXTEllEQJbWf4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Keri Pearlson",
        "title": "Executive Directory (IC)3",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWM3&d=%2Fa%2F6g000000gLf0%2FkkKialgbYYY_wm0S3jtWh3y4Rj2ISNl4zx_QpQxZTcc&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Keri Pearlson is the Executive Director of the Cybersecurity at MIT Sloan: The Interdisciplinary Consortium for Improving Critical Infrastructure Cybersecurity (IC)3  at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Michael D. Siegel",
        "title": "Director, Cybersecurity at MIT Sloan and Principal Research Scientist",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1pm&d=%2Fa%2F6g000000gKxc%2FYWxuQHpo6i4Dut6uzNPXo5KCey4qSrppcSqWpm1tvVE&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Michael Siegel is a Principal Research Scientist at the MIT Sloan School of Management and is currently the Co-Director of the PROductivity from Information Technology (PROFIT) Project.  Siegel’s research interests include the integration and use of information from multiple and the use of modeling and data analytics to analyze complex systems.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Pierre Azoulay",
        "title": "International Programs Professor of ManagementProfessor, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1i2&d=%2Fa%2F6g000000gKql%2FWLjXXzE8uK3Tr79y957TmHbopBdSwtp1fNhRYwY_irE&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Pierre Azoulay is the International Programs Professor of Management at the MIT Sloan School of Management, and a Research Associate at the National Bureau of Economic Research.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Robert C. Pozen",
        "title": "Senior Lecturer, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1wn&d=%2Fa%2F6g000000gL49%2F7c3KHO8qwDxbKjTzWjm.0j2m80uF2AMf9qu9Za8ziSE&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Robert C. Pozen is currently a Senior Lecturer at MIT Sloan School of Management and a non-resident Senior Fellow at the Brookings Institution.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Ben Shields",
        "title": "Senior Lecturer, Managerial Communication",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R21E&d=%2Fa%2F6g000000gL8f%2F83LQESbpShlF6yvdYwtUKE1mlcwc9vWEI6T2nM_azgI&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Ben Shields is a Senior Lecturer in Managerial Communication at the MIT Sloan School of Management. He studies the multibillion-dollar sports industry to identify broadly transferable management lessons in areas such as leadership communication, data-driven decision making, and innovation. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Ezra W. Zuckerman Sivan",
        "title": "Alvin J. Siteman (1948) Professor of Entrepreneurship and StrategyAssociate Dean for Teaching and Learning",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1lf&d=%2Fa%2F6g000000gKuE%2FHA6d7fcrjoJue.eqbsNxDyhyvUDEWnEI_hfhjFhqv2Y&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Ezra Zuckerman Sivan is Associate Dean for Teaching and Learning and the Alvin J. Siteman (1948) Professor of Strategy and Entrepreneurship. He is also cofounder of MIT Sloan's PhD Program in Economic Sociology.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Leonid Kogan",
        "title": "Nippon Telegraph & Telephone Professor of ManagementProfessor, Finance",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1tt&d=%2Fa%2F6g000000gL1Z%2FqOmHwYJWZ7ZqhXY9hXjFNJ0w2CuF.uTXHlyVvAj7w_Q&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Leonid Kogan is the Nippon Telegraph and Telephone Professor of Management and a Professor of Finance at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Paul F. Mende",
        "title": "Senior Lecturer, Finance",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1xv&d=%2Fa%2F6g000000gL5H%2FxQXKtkFLfVWgw7.YRSyagztd69jDdOGqIOAIf.eFya0&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Paul Mende is a Senior Lecturer in the Finance Group at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "David Thesmar",
        "title": "Franco Modigliani Professor of Financial EconomicsProfessor, Finance",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1vw&d=%2Fa%2F6g000000gL6L%2FUjRrC9JJFmj.8gvPIA1_22TpWURXPldE28MpO9Gm4.U&asPdf=false",
        "pdf_url": "",
        "intro_desc": "David Thesmar is the Franco Modigliani Professor of Financial Economics and a Professor of Finance at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Adrien Verdelhan",
        "title": "Stephens Naphtal Professor of FinanceAssociate Professor, Finance",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1qB&d=%2Fa%2F6g000000gKy6%2FGhiUFnr9GdF5qQ8uFf69QMCM3y_nTTlWlGWjGhWnm1U&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Adrien Verdelhan is the Stephens Naphtal  Professor of Finance and an Associate Professor of Finance at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Jeanne W. Ross",
        "title": "Principal Research Scientist",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWAW&d=%2Fa%2F6g000000gLeQ%2FuPth7R7RdRnfMtjf6sAHvbV4fhqTGaxYYIlE_AQ6Efc&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Jeanne Ross conducts research that explores how companies are designing themselves for success in the digital economy. Her recent work develops case studies describing how companies formulate and execute business strategies inspired by the capabilities of digital technologies (e.g. social, mobile, analytics, cloud, Internet of Things, and artificial intelligence). She has facilitated discussions of business design (i.e. enterprise architecture) with executive committee members of major companies like Aetna, Banco do Brasil, Bemis, CEMEX, Commonwealth Bank of Australia, Maersk, PepsiCo, Santander, and Standard Bank Group. Jeanne joined MIT CISR in 1993; she was director of the center from 2008 to 2016.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Sheila Dodge",
        "title": "Lecturer, System Dynamics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW8i&d=%2Fa%2F6g000000gLe7%2F5lNu_t1I.mdUZJOqySPda69KV3fp7plTsJ6XYk.MJj4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Sheila Dodge is the General Manager of Operations and Development for the Genomics Platform at the Broad Institute in Boston, Massachusetts. She directs a team of more than150 scientists, engineers and laboratory technicians who develop and run DNA sequencing production processes. She oversees daily operations of the Labs, IT, and Engineering as well as new project and new process execution that keep this organization at the front edge of an industry where changing technology and speed are critical.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Donald Kieffer",
        "title": "Senior Lecturer, Operations Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73No&d=%2Fa%2F6g000000gvV7%2FlczABZ1ledANnE7YjO2A9q9I4G1fjLDPocRGA6J8UtA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Donald Kieffer is a Senior Lecturer in Operations Management at MIT Sloan.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Nelson P. Repenning",
        "title": "School of Management Distinguished Professor of System Dynamics and Organization StudiesAssociate Dean of Leadership and Special Projects",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1v1&d=%2Fa%2F6g000000gL2N%2FF_E6W3t2bB1aw39keZHe1BXdr7SG0HXFEot.4eAxIPg&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Nelson P. Repenning is the Associate Dean of Leadership and Special Projects, the Faculty Director of the MIT Leadership Center, and the School of Management Distinguished Professor of System Dynamics and Organization Studies at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "David Autor",
        "title": "Ford Professor of Economics and Associate Head of MIT Economics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73Gq&d=%2Fa%2F6g000000gvTk%2FZmgbTBR78FBoZ3hMZ7fGmYuN1ZmyP84zU1hnjG1l.d4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "David Autor is a Professor and Associate Department Head of the Massachusetts Institute of Technology Department of Economics. He is also a Faculty Research Associate of the National Bureau of Economic Research and Editor in Chief of the Journal of Economic Perspectives (published by the American Economic Association), and has served on the Board of Editors at the American Economic Journal: Applied Economics and the Journal of Labor Economics. Autor received a BA in Psychology from Tufts University in 1989 and a PhD in Public Policy at Harvard University’s Kennedy School of Government in 1999.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Randall Davis",
        "title": "MIT Professor",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73Nn&d=%2Fa%2F6g000000gvUE%2FbqT3dSYunxUiMhZCfXiO7zgpwWnOmCkQD.UP_7ejKK0&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Randall Davis received his undergraduate degree from Dartmouth, graduating summa cum laude, Phi Beta Kappa in 1970, and received a PhD from Stanford in artificial intelligence in 1976. He has served as Associate Director of MIT’s Artificial Intelligence Laboratory (1993-1998), as a Research Director of CSAIL (2003-2007), and as Associate Director of CSAIL (2012-2014). ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Frank Levy",
        "title": "Professor Emeritus of Urban Economics at MIT DUSP",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6zH4&d=%2Fa%2F6g000000gvWP%2FQfnvVUs0KcQWPvGk7qIXMIOqlbBVMyyGbIs61zIqTK8&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Frank Levy is an economist - “retired from teaching and department meetings but not much else.” He works on the impact computers have on jobs and living standards, and on the economics of radiology. In the spring of 2015, Levy concluded a three year term co-organizing the CSAIL/Economist Seminar series at MIT bringing together computer scientists and economists to better understand computerized work. He has also co-organized the De Lange Conference on the Future of Work at Rice University. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Andrew W. Lo",
        "title": "Charles E. and Susan T. Harris ProfessorProfessor, FinanceDirector, Laboratory for Financial Engineering",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1gR&d=%2Fa%2F6g000000gKol%2F68crJxuzdSoozp2oM1kR2AT3T1s8KClzVKaIXwGtnDQ&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Andrew W. Lo is the Charles E. and Susan T. Harris Professor, a Professor of Finance, and the Director of the Laboratory for Financial Engineering at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Thomas W. Malone",
        "title": "Patrick J. McGovern (1959) Professor of ManagementProfessor, Information TechnologyDirector, MIT Center for Collective Intelligence",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1rs&d=%2Fa%2F6g000000gKzi%2FgNsOOK0ncDfZwKOQy2IHUT9.MnYxGVxVLRsPLy3Wfmo&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Thomas W. Malone is the Patrick J. McGovern (1959) Professor of Management at the MIT Sloan School of Management and the founding director of the MIT Center for Collective Intelligence. At MIT, he is also a Professor of Information Technology and a Professor of Work and Organizational Studies. Previously, he was the founder and director of the MIT Center for Coordination Science and one of the two founding codirectors of the MIT Initiative on Inventing the Organizations of the 21st Century. Malone teaches classes on organizational design, information technology, and leadership, and his research focuses on how new organizations can be designed to take advantage of the possibilities provided by information technology.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Iyad Rahwan",
        "title": "Associate Professor of Media Arts and Sciences, MIT Media Lab",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A74iR&d=%2Fa%2F6g000000gvWK%2F0tSESQdDNRS9c6X5frlmK8T.7i9sHNN_P.2IfWVuMVE&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Iyad Rahwan is the AT&T Career Development Professor and an Associate Professor of Media Arts & Sciences at the MIT Media Lab, where he leads the Scalable Cooperation group. A native of Aleppo, Syria, Rahwan holds a PhD from the University of Melbourne, Australia, and is an affiliate faculty at the MIT Institute of Data, Systems and Society (IDSS). ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Daniela Rus",
        "title": "",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWAX&d=%2Fa%2F6g000000gLeX%2FXfJq6j9rVNnL_Yp7IsS1V3rOIM6BQJzWzyHCgQrfMVs&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Daniela Rus is the Andrew (1956) and Erna Viterbi Professor of Electrical Engineering and Computer Science; Director of the Computer Science and Artificial Intelligence Laboratory (CSAIL); and Deputy Dean of Research for Schwarzman College of Computing at MIT. Rus’ research interests are in robotics, artificial intelligence, and data science.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "James Glass",
        "title": "Senior Research Scientist, Head of Spoken Language Systems Group, Computer Science and Artificial Intelligence Laboratory (CSAIL",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW8f&d=%2Fa%2F6g000000gLe4%2F1xDwTD.E.EEPtTAJl0uUoW0ExCMeK0UJygVvKd_AAKc&asPdf=false",
        "pdf_url": "",
        "intro_desc": "James Glass is a Senior Research Scientist at the Massachusetts Institute of Technology where he leads the Spoken Language Systems Group in the Computer Science and Artificial Intelligence Laboratory. He is also a member of the Harvard-MIT Health Sciences & Technology Faculty. Since obtaining his S.M. and Ph.D. degrees at MIT in Electrical Engineering and Computer Science, his research has focused on automatic speech recognition, unsupervised speech processing, and spoken language understanding using machine learning. He is an IEEE Fellow, and a Fellow of the International Speech Communication Association, and is currently an Associate Editor for the IEEE Transactions on Pattern Analysis and Machine Intelligence.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Stefanie Jegelka",
        "title": "X-Consortium Career Development Assistant Professor, Department Electrical Engineering & Computer Science",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW7X&d=%2Fa%2F6g000000gLeN%2Fcizt3IKoipmgn4KlBWBzjg1o72CEdncMFEEHow1zLJA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "As data changes in scope and value, the ability to understand different types of data is becoming a key factor for unlocking progress in science and technology. One way to make sense of data—whether in the form of images, networks, measurements, or subsets—is through machine learning. By developing new machine-learning methods with discrete and structured data that makes learning more accurate and efficient, MIT researchers are making machine learning widely applicable, reliable, and robust.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Joshua Tenenbaum",
        "title": "Professor, Department of Brain and Cognitive Sciences",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWEV&d=%2Fa%2F6g000000gLec%2Fh8M3QHYR23itdeFn5Q5g_XE6ovBk7amW0qQH_mqdd5Q&asPdf=false",
        "pdf_url": "",
        "intro_desc": "My colleagues and I in the Computational Cognitive Science group study one of the most basic and distinctively human aspects of cognition: the ability to learn so much about the world, rapidly and flexibly. Given just a few relevant experiences, even young children can infer the meaning of a new word, the hidden properties of an object or substance, or the existence of a new causal relation or social rule. These inferences go far beyond the data given: after seeing three or four examples of “horses”, a two-year-old will confidently judge whether any new entity is a horse or not, and she will be mostly correct, except for the occasional donkey or camel.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Antonio Torralba",
        "title": "Professor, Department of Electrical Engineering and Computer Science| Director of Quest for Intelligence | MIT Director MIT-IBM Watson AI Lab",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWF9&d=%2Fa%2F6g000000gLed%2FAFtcu9Pk5N2KAXph9EEYedgPLaDyBm2iDjfcYnhmveU&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Antonio Torralba is a Professor of Electrical Engineering and Computer Science at the Massachusetts Institute of Technology (MIT), the MIT director of the MIT-IBM Watson AI Lab, and the inaugural director of the MIT Quest for Intelligence, an MIT campus-wide initiative to discover the foundations of intelligence. He received the degree in telecommunications engineering from Telecom BCN, Spain in 1994 and the Ph.D. degree in signal, image, and speech processing from the Institut National Polytechnique de Grenoble, France in 2000. From 2000 to 2005, he spent postdoctoral training at the Brain and Cognitive Sciences Department and the Computer Science and Artificial Intelligence Laboratory, MIT, where he is now a professor.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Kara Blackburn",
        "title": "Senior Lecturer, Managerial Communication",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1oM&d=%2Fa%2F6g000000gKwb%2FUZE5.LLxZ0OTnC4P70FQl_1n_F9OypWJ..Y15R91V2I&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Kara Blackburn is a Senior Lecturer in Managerial Communication at the MIT Sloan School of Management and an affiliate of MIT Sloan's Leadership Center.  Blackburn teaches Communication for Leaders and runs the accompanying Communications Lab for full-time MBA students. Blackburn also teaches Advanced Communication for Leaders, an elective for full-time MBA students and Sloan Fellows.  Blackburn co-created and teaches a new elective at MIT Sloan, Leading the Way: Perspectives on Advancing Equity and Inclusion. She also teaches in MIT Sloan’s Executive Education programs.  Blackburn was awarded the Jamieson Prize for Excellence in Teaching at MIT Sloan in 2019. She was also a recipient of the 2020 .",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Thomas Kochan",
        "title": "Professor, Work and Organization StudiesCo-Director, MIT Sloan Institute for Work and Employment Research",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1rx&d=%2Fa%2F6g000000gKzn%2FPT3X4112.w_nMNvoZZIug_7xtl7wq7Ijp1_eMrhEmt0&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Jared R. Curhan",
        "title": "Gordon Kaufman Professor of ManagementAssociate Professor, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1oL&d=%2Fa%2F6g000000gKwa%2FRGwIhK.Eky0rRTb7qmn1.jcxyFy_.R.VOiap0jD_a.M&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Jared Curhan is the Gordon Kaufman Professor and an Associate Professor of Work and Organization Studies at the MIT Sloan School of Management, as well as Faculty Director of MIT’s Behavioral Research Lab.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Roger Lehman",
        "title": "Senior Lecturer",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW8h&d=%2Fa%2F6g000000gLeO%2Fy0JYtghV5aZqlnlW2oHKDMC6ehYs9SOn4J_fcBO14jg&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Roger Lehman is a Senior Lecturer at the MIT Sloan School of Management and a professor at INSEAD's Singapore campus. At INSEAD, he designs and teaches in both open and company specific programs, providing a focus on executive leadership, personal and professional development, change management and high performance teams. In addition, he is a member of the core faculty at the INSEAD Global Leadership Center. As co-designer and Program Director of INSEAD’s innovative Coaching and Consulting for Change Program, he is deeply involved in supporting leadership transformational processes.  ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Kate Isaacs",
        "title": "Lecturer, MIT Sloan School Of ManagementExecutive Fellow, Center for Higher Ambition LeadershipPartner, Dialogos",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWQP&d=%2Fa%2F6g000000gLfP%2FMYvvvzFuE1jSTTcLD0vGgtP1dmFImI3pX2fGs.y7JvQ&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Dr. Isaacs holds a PhD in Organization Studies from the MIT Sloan School of Management, where her work straddles two broad domains. One is the technology of collaboration, in particular collaboration that engages multiple stakeholders across organizational boundaries and societal sectors to achieve common goals. The second domain involves the strategic purpose and design of private enterprise, including the strategies and practices that firms use to engage external stakeholders, as well as new organizational forms of \"distributed leadership,\" in which many individuals, not just formal leaders, work across boundaries to mobilize the collective intelligence of a social system to attain desired goals. These new organizations exhibit flattened structural hierarchies; more nimble, flexible strategic capabilities; and an empowered workforce with greater knowledge and responsibility to achieve organizational aims. Read more about her academic research at .",
        "university_school": "3514_SMGT"
    },
    {
        "name": "John E. Core",
        "title": "Nanyang Technological University Professor of AccountingProfessor, Accounting",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1w5&d=%2Fa%2F6g000000gL3H%2FHZ2hJ3XVJhd_oUftUJcRIXWux8gsvI435NxzLzpqSKk&asPdf=false",
        "pdf_url": "",
        "intro_desc": "John E. Core is the Nanyang Technological University Professor and a Professor of Accounting at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Christopher F. Noe",
        "title": "Senior Lecturer, Accounting",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1t6&d=%2Fa%2F6g000000gL0w%2FEIj3Q88hsPNvAKo8TgxLO8oVnWvg5nDHtaD4zS.Uppc&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Christopher Noe is a Senior Lecturer in Accounting at the Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Edward Schiappa",
        "title": "Professor of Comparative Media Studiesformer Head of Comparative Media Studies/WritingJohn E. Burchard Professor of Humanities",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWAY&d=%2Fa%2F6g000000gLdw%2FgULKRwn1kPGNUwciilNQh83ei_tyAxcWuIp0FCJsbE0&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Edward Schiappa is Professor and former Head of Comparative Media Studies/Writing in MIT’s School of Humanities and Social Sciences, where he holds the John E. Burchard Chair of Humanities.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Steven Spear",
        "title": "Senior Lecturer, System Dynamics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1wd&d=%2Fa%2F6g000000gL3z%2FwisN6HcQLdELgwcQuchzN5kpU2kPU4piiKSGTn3oXrk&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Steven Spear is a Senior Lecturer at the MIT Sloan School of Management and at the Engineering Systems Division at MIT.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Matthew S. Kressy",
        "title": "Director and Founder, MIT Integrated Design & Management (IDM) Senior Lecturer Principal, Designturn Inc.",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWCi&d=%2Fa%2F6g000000gLdy%2FDjTbTtHh1VrkjGkQw6h7l1FHRr2y2vwfP.5PMZNR8a4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Matthew S. Kressy, director and founder of the MIT Integrated Design & Management (IDM) master’s degree track, is an expert in product design and development. As an entrepreneur and founder of Designturn, he has designed, invented, engineered, and manufactured products for startups, Fortune 500 companies, and everything in between.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "David Robertson",
        "title": "Senior Lecturer, Operations Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWF8&d=%2Fa%2F6g000000gLeb%2FyqWdEnGorMObNXK0YB6OUimTUEdnBsTgAK9xCgHZ4Oc&asPdf=false",
        "pdf_url": "",
        "intro_desc": "David Robertson is a senior lecturer at the MIT Sloan School of Management where he teaches Product Development and Digital Product Management. Prior to MIT, Robertson was a Professor of Practice at the Wharton School at the University of Pennsylvania and from 2002 through 2010 was the LEGO Professor of Innovation and Technology Management at IMD in Lausanne, Switzerland. Robertson has also held several executive management positions in enterprise software companies, and spent five years at McKinsey & Company in the U.S. and Sweden.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Nils O Fonstad",
        "title": "Research Scientist, Europe and LATAM",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW8e&d=%2Fa%2F6g000000gLeC%2FVpq5tn2TqO8U2J2zwuiwfjrrl8K3NDeGYeSPvh2pxiY&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Nils researches competitive digital innovation and how organizations are redesigning themselves to realize greater impact from a diverse portfolio of innovation efforts. Drawing on both in-depth qualitative data and survey data from hundreds of firms, he has identified what investments and innovation practices distinguish the most competitive firms. In 2010, he co-founded with CIONET the annual European CIO of the Year Awards to raise awareness of especially-accomplished digital leaders. Based in Madrid, Nils is responsible for both fostering relations with organizations from Europe and Latin America and conducting research on how firms maximize business value and minimize risks from digitization.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Michael Schrage",
        "title": "Research Fellow with MIT Sloan School's Initiative on the Digital Economy",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWBq&d=%2Fa%2F6g000000gLeg%2FWGS6uHp3t3G4H9ZwCm3yq0zGpEqIuvusZxeeDP4hQVs&asPdf=false",
        "pdf_url": "",
        "intro_desc": "A research fellow with MIT Sloan School's Initiative on the Digital Economy, Michael Schrage’s research, writing and advisory work focuses on the ‘behavioral economics’ of models, prototypes and metrics as strategic resources for managing ‘innovation risk’ and opportunity. He is author of award-winning ’The Innovator’s Hypothesis’ [MIT Press 2014], ‘Who Do You Want Your Customers To Become?’ [Harvard Business Review Press 2012] and ‘’ [Harvard Business Review Press 2000].  His next book, ‘,’ will be published this year by MIT Press as part of its ‘Essential Knowledge’ series. He’s run design workshops and executive education programs on innovation, experimentation and ’strategic measument' for organizations all over the world.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Nick van der Meulen",
        "title": "Research Scientist",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6Ss0&d=%2Fa%2F6g000000gtOi%2FNpRQ69CcTVpYeVWLpgSXGcv6FvgYDDyRZ9Ymm96e2NM&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Dr. Nick van der Meulen is a Research Scientist at the MIT Sloan Center for Information Systems Research (MIT CISR). He conducts academic research that targets the challenges of senior level executives at MIT CISR's nearly 100 global sponsor companies, with a specific interest in how companies need to organize themselves differently in the face of continuous technological change. His work on digital workplaces and the employee experience resulted in a range of academic and industry publications, in outlets such as the , and the . Currently, he examines how decision rights are changing in the context of digital business transformation.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Stephanie Woerner",
        "title": "Research Scientist",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWP7&d=%2Fa%2F6g000000gLf5%2F.51VVv5s4THkAKd8p94Us2pfWc6UbrpQByalRqoG1CU&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Stephanie Woerner is a Research Scientist at the MIT Sloan Center for Information Systems Research. She studies how companies manage organizational change caused by the digitization of the economy.  Her research centers on enterprise digitization and the associated governance and strategy implications. Three current studies include i. the amount, allocation, and impact of enterprise-wide digital investments, ii. how digitization is influencing the next-generation enterprise, and iii. the impact of the Internet of Things on company business models and the competitive landscape. In previous National Science Foundation-funded work, she studied distributed work teams and their use of multiple media, electronic communication technologies, and coordination mechanisms to get work done; she was also project manager for the 5-year grant.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Silvio Micali",
        "title": "Ford Professor of Engineering",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6zJo&d=%2Fa%2F6g000000gvWF%2F3EMw1jtQXwi17KmwFm9y4t2uwYtVaIr..zCbX8_kXO8&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Silvio Micali has received his Laurea in Mathematics from the University of Rome, and his PhD in Computer Science from the University of California at Berkeley. Since 1983, he has been on the faculty of the Electrical Engineering and Computer Science Department at MIT.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Miro Kazakoff",
        "title": "Senior Lecturer, Managerial Communication",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1jj&d=%2Fa%2F6g000000gKsI%2FtBZInT_VaHq9vRKD_SnSfGouINiimNKrofT3pOT7yJw&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Miro Kazakoff is a Senior Lecturer in Managerial Communication at the MIT Sloan School of Management where he focuses on how individuals use data to persuade others. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Erin L. Scott",
        "title": "Senior Lecturer, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R235&d=%2Fa%2F6g000000gLAb%2Fh0gutqqFFO2eh9iaFcHmc9BcI_0fQx.JOF2mybeI5wM&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Erin L Scott is a Senior Lecturer in Technological Innovation, Entrepreneurship, and Strategic Management at the MIT Sloan School of Management.  ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Scott Stern",
        "title": "David Sarnoff Professor of Management of TechnologyProfessor, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1sb&d=%2Fa%2F6g000000gL0R%2FX4Qlt9NhtNLBQbkyb59LPOLNgYadhXCbKdgBY83Nk8s&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Scott Stern is the David Sarnoff Professor of Management at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Ralph Katz",
        "title": "Senior Lecturer, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1lG&d=%2Fa%2F6g000000gKtp%2FVoQkN_pPZAPFbMHMMtITWnzTZK6Hgs9gq_tnfm9dmxA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Ralph Katz is a Senior Lecturer in Technological Innovation, Entrepreneurship, and Strategic Management at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Bridget Scott Akinc",
        "title": "Senior Lecturer",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0684v00000DudWE&d=%2Fa%2F4v0000001oMY%2FNdx2txRUFifJjDjFUl9qxPWCmkFnqY09ykz5OfPlhSw&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Bridget Scott Akinc believes in local engagement and systems change to strengthen communities. Passionate about innovation and finding new ways to work toward solving complex social challenges, Bridget leads Building Impact, a nonprofit organization that engages leading companies and brands in local communities through volunteering and capacity-building. Bridget joined Building Impact as CEO in 2017 and in four short years, catalyzed the earned-revenue growth of the organization, and expanded the operations from one state to thirty, while measuring the impact for nonprofits in new ways.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "James C. Rhee",
        "title": "Senior Lecturer",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A8Ehb&d=%2Fa%2F6g000000gw9Z%2FQNQepB5cJKC_1uPrFjUz_sbvCe_QjZwxwYMd3nn1zN4&asPdf=false",
        "pdf_url": "",
        "intro_desc": "As impact investor, CEO, and educator, James Rhee empowers people, brands, and organizations to fulfill their true potential by marrying capital with purpose and truth across multiple systems. He is an award-winning entrepreneur and thought leader on such topics as multi-dimensional transformation, the intersection of capital and race/gender, and values-based investing and leadership. James has achieved success within multiple industries and communities, and he leverages these connections and learnings to identify and accelerate opportunities for systems change by forging unusual alliances amongst seemingly disparate ideas and peoples. The story of the whys and the hows of the remarkable transformation of Ashley Stewart under his leadership as chairman and CEO (2013-2020) has served as proof to millions of people, as well as the world’s leading businesses and organizations, that one can do better by being better.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Joshua E Siegel",
        "title": "Lecturer, MIT Sloan School of Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6vRY&d=%2Fa%2F6g000000gvBQ%2FN13Sf52eUxwVXWYS0AwRMassuj9lnRWBCC0F6JgifSU&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Josh Siegel is an Assistant Professor of Computer Science and Engineering at Michigan State University and the lead instructor for the Massachusetts Institute of Technology's DeepTech and Internet of Things Bootcamps. He received Ph.D., S.M. and S.B. degrees in Mechanical Engineering from MIT.  Josh and his automotive companies have been recognized with accolades including the Lemelson-MIT Student Prize and the MassIT Government Innovation Prize. He has multiple issued patents, published in top scholarly venues, and been featured in popular media. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "John Van Maanen",
        "title": "Erwin H. Schell Professor of Management EmeritusProfessor, Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1mZ&d=%2Fa%2F6g000000gKvD%2F363PA2oO_KwRr9z6svhGxHiCcQkuFLDAOpkL5lZ7a_c&asPdf=false",
        "pdf_url": "",
        "intro_desc": "John Van Maanen is the Erwin H. Schell Professor of Management, Emeritus and a Professor of Organization Studies, Emeritus at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Erin Kelly",
        "title": "Sloan Distinguished Professor of Work and Organization StudiesProfessor, Work and Organization Studies",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R21n&d=%2Fa%2F6g000000gL9E%2FpCM3c4V7BoIsWMy6j92cr8RyxKw5ggOiHcyAqOlra3o&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Erin L. Kelly is the Sloan Distinguished Professor of Work and Organization Studies at the MIT Sloan School of Management and CoDirector in the Institute for Work and Employment Research. She is also Faculty Director of the the Good Companies, Good Jobs Initiative.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "J. Bradley Morrison",
        "title": "Senior Lecturer, Leaders for Global Operations Program",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1gB&d=%2Fa%2F6g000000gKoQ%2FFaQ_.ypCutit4BHjbLl8nvw3U5uR5LgDmBrePwozQzQ&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Brad Morrison is fascinated with the challenges people face in accomplishing what they set out to do in organizations. His research focuses on two areas: 1) human performance in dynamically challenging health care contexts and 2) implementation, which he as studied in several contexts, such as process improvement settings and firms adopting the practices of lean manufacturing. He examines the paradoxes of building organizational capability and implementing innovations. For example, why do the actions some managers take foster the very problems they are attempting to solve? His methods blend organization theory with tools of system dynamics, feedback theory, mathematical modeling and computer simulation to elucidate the relationships between structure in systems and the patterns of dynamic behavior they exhibit over time.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "William Fischer",
        "title": "Senior Lecturer, Operations Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A6DYc&d=%2Fa%2F6g000000gqmC%2FHkC.xTT7wHjLrtsTqB_jjdy2JT.t6q8N0bqbCB6gX00&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Bill Fischer is a Visiting Professor of Operations Management at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Trish Cotter",
        "title": "Senior Lecturer in Entrepreneurship",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73Lf&d=%2Fa%2F6g000000gvTz%2Fu.fYXLKKjpGjOFX78qzVvo6JJKMCjWt8ZgtRSapfrYA&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Trish Cotter is a Senior Lecturer and Executive Director of the Martin Trust Center for MIT Entrepreneurship. Trish is also Entrepreneur-in-Residence at MIT and Director of delta v - a capstone program for MIT Entrepreneurship. Trish mentors students through the accelerator process for their start-up ventures and was awarded the 2018 Monosson Prize for Entrepreneurship Mentoring.\n\nTrish was previously an executive at two emerging companies which she helped to bring public (Netezza in 2007 and Visual Networks in 1998). When Netezza was acquired by IBM for $1.8 billion in 2010, Trish served in the role of president of Netezza LLC during the integration process. She has a background in engineering, and has held various engineering and management positions at Honeywell, Computervision, Sun Microsystems, and Stratus.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Kit Hickey",
        "title": "Lecturer and Entrepreneur in Residence",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73P0&d=%2Fa%2F6g000000gvUF%2FJD0k.ksNPoohgbxlFP74.WKHkxuL8F3K.C.pfIl1M6g&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Matthew Rhodes-Kropf",
        "title": "Visiting Associate Professor, Finance",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R22M&d=%2Fa%2F6g000000gL9n%2Fjxxd2NJs6CotnMaXwSJw2ttOI6hMnM228VPee9_XOq0&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Charles Harry Fine",
        "title": "Chrysler Leaders for Global Operations Professor of ManagementProfessor of Operations Management and Engineering SystemsCo-Director, International Motor Vehicle Program",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1qL&d=%2Fa%2F6g000000gKyB%2FusamXqQfXFVqatMhy0XPplRYrMp4J1US_GR.YSD5D4c&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Charles Fine is the Chrysler Leaders for Global Operations Professor of Management at the MIT Sloan School of Management. SInce 2015 he has also served as CEO, President, and Dean of the Asia School of Business (in Kuala Lumpur), established in collaboration with MIT Sloan.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Loredana Padurean",
        "title": "Research Affiliate, MIT SloanAssociate Dean, Faculty Director of Action Learning at the Asia School of Business",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWET&d=%2Fa%2F6g000000gLe9%2FW8MPO.qtHPcfg7Gig83St9JXHxE3aVZOf3CmufKLss8&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Loredana Padurean is the Associate Dean and Faculty Director for Action Learning at the Asia School of Business, established in collaboration with MIT Sloan in Kuala Lumpur, Malaysia. Her most recent research “Nail it, Scale it, Sail it - Evolutionary Entrepreneurship” focuses on how companies evolve from early stage start-ups large successful companies and maps the capabilities and tools necessary for each stage of the process. Loredana is an International Faculty Fellow at MIT Sloan with global teaching and public speaking experience in USA, Asia-Pacific and Europe.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Duncan Simester",
        "title": "NTU Professor of MarketingProfessor, Marketing",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1tF&d=%2Fa%2F6g000000gL10%2FoTXYAiP.7nV1hVgCHDJf2PBeM7X8pEBi6XzT2VDW_yY&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Duncan Simester is a professor at the MIT Sloan School of Management where he holds the NTU Chair in Management Science. He is an expert on how economics and artificial intelligence can contribute to the understanding and practice of marketing and strategy. His work is widely published in the academic literature. The studies rely heavily on industry participation, and often include large-scale field experiments conducted with cooperating firms. Simester regularly consults with a variety of organizations on topics related to marketing strategy, go-to-market strategies, and the use of artificial intelligence and experiments to improve business decisions.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Jake Cohen",
        "title": "Senior Associate Dean for Undergraduate and Master's Programs",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1q7&d=%2Fa%2F6g000000gKy2%2F9kVsSzlwuVyW5kjedwdQP3uzSPKuPV2U9p.FstROnik&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Jake Cohen is Senior Associate Dean for Undergraduate and Master’s Programs and a Senior Lecturer in Accounting and Law at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "John A. Davis",
        "title": "Senior Lecturer, Family Enterprise Executive Programs",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWHm&d=%2Fa%2F6g000000gLeq%2FyYrkhzFbGhDmDibrh0fQXpuH3iB5Ybo3ajf67z.WQwk&asPdf=false",
        "pdf_url": "",
        "intro_desc": "John A. Davis is a Senior Lecturer in the Family Enterprise Executive Programs at the MIT Sloan School of Management. He is a globally recognized pioneer and authority on issues related to the family enterprise, family wealth, and the family office. Since the 1970s, he has been a leading researcher, professor, author, advisor, and speaker on family enterprise, and is the creator of some of the field’s most impactful conceptual frameworks. His insights help to develop leaders, strengthen families, professionalize businesses and family offices, grow shareholder value, and pass sustainable enterprises to the next generation.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Jonathan Ruane",
        "title": "Lecturer, Global Economics and Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g00000A73bu&d=%2Fa%2F6g000000gvVl%2FAcHew24nJHyg2a7W0hEp5yd3UG8zhnq5sI62oNiLfT8&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Jonathan Ruane is a Lecturer in the Global Economics and Management group at the MIT Sloan School of Management and a Research Scientist at MIT’s Initiative on the Digital Economy (IDE). His interests are at the intersection of technology, entrepreneurship, strategy, and international markets. He also is an Adjunct Professor at Trinity College Dublin and a Fulbright recipient.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Elsbeth Johnson",
        "title": "Senior Lecturer, Technological Innovation, Entrepreneurship, and Strategic Management",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RwD5&d=%2Fa%2F6g000000gMMs%2FplCKx07CZI9x21sYkARBpewhDZf8lHqRlAi1lieQnH0&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Elsbeth Johnson is a Senior Lecturer at the MIT Sloan School of Management and an expert on leadership, strategy and change. The main focus for her research is on what leaders need to do to help their organizations execute strategy, or deliver long-term, strategic change, without the need for the leader’s ongoing, personal involvement.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Matthew Marx",
        "title": "Associate Professor of Strategy and Innovation at the Boston University Questrom School of Business",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWM2&d=%2Fa%2F6g000000gLev%2Fpm1qazMezcZ47FlG6kzAecSrZIJMUuHXECBOOf0jyFw&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Matthew Marx is an Associate Professor of Technological Innovation, Entrepreneurship, and Strategic Management at the MIT Sloan School of Management. ",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Antoinette Schoar",
        "title": "Stewart C. Myers-Horn Family Professor of FinanceProfessor, Finance",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1lC&d=%2Fa%2F6g000000gKtl%2FusScXra9vf_KeTbvkm5iMyZ5_GnBhW7OqjmogPNGd.g&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Antoinette Schoar is the Stewart C. Myers-Horn Family Professor of Finance at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Hazhir Rahmandad",
        "title": "Schussel Family Professor of Management ScienceAssociate Professor, System Dynamics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0684v00000GGqit&d=%2Fa%2F4v000000271Y%2FKnTA_BbY6WhU4mf3eWfftv7WeRpHd41IrhDWxwwDV1U&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Hazhir Rahmandad is the Schussel Family Professor of Management Science and an Associate Professor of System Dynamics at the MIT Sloan School of Management.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Daena Giardella",
        "title": "Senior Lecturer, MIT Leadership Center",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1uy&d=%2Fa%2F6g000000gL3R%2FugvQA42pmdyFbl_jx8Izkl7Gj2E33QhzZngqVodjk3Y&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Daena Giardella is a Senior Lecturer at the MIT Sloan School of Management and a Faculty Affiliate of the MIT Leadership Center.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Rob Salafia",
        "title": "Founder and President, Protagonist Consulting Group",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RWFg&d=%2Fa%2F6g000000gLeY%2FBhM_sGmELHXk531qB9ll6Af7UNTc24p2g_6vNjvD93g&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Rob combines two decades of experience as a top leadership development executive with a well-established career in the performing arts. He is known for creating long-lasting client relationships and supporting executives through transformative learning experiences. Rob has a passion for helping leaders develop their presence, tell compelling stories and establish authentic connections, in order to deliver on their business goals and development plans. He assists leaders to share vision and strategy in a compelling way that connects and is relevant to every person in the room. This is particularly effective for executives working through disruptive change and business transformation that will require people power up and sustain performance for an extended period of time.",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Anjali Sastry",
        "title": "Senior Lecturer, System Dynamics",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009R1r9&d=%2Fa%2F6g000000gKyz%2F73tt8TV0_PDXyFQkDBBvFaDIQ7cOds1Dqdi_G9AQHaI&asPdf=false",
        "pdf_url": "",
        "intro_desc": "",
        "university_school": "3514_SMGT"
    },
    {
        "name": "Sam Abell",
        "title": "Photographer",
        "pic_url": "https://mitexeced--c.documentforce.com/sfc/dist/version/download/?oid=00D6g000006yH4p&ids=0686g000009RW5K&d=%2Fa%2F6g000000gLdd%2Fn28EejAjo_W23HaD5x98vPEtX53PRz7lkYMOpSCmJSQ&asPdf=false",
        "pdf_url": "",
        "intro_desc": "Sam Abell is a gifted and insightful teacher, an expressive artist, and a sensitive photographer who learned photography from his father, Thad Abell. Sam worked for National Geographic as a contract and staff photographer, and also as a Photographer in Residence. In 1990, his work was the subject of a one-person exhibition at the International Center of Photography in New York. Since then he has published three collections of his work:, and . In addition, Sam maintains a career as a writer, teacher, and lecturer on photography. This is his 24th year teaching at the Santa Fe Photography Workshops.",
        "university_school": "3514_SMGT"
    }
]